In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import plotly.express as px
import seaborn as sb
from collections import Counter

In [2]:
df = pd.read_csv(r"C:\Users\DELL\Downloads\archive\offersleaks(edited).csv")
df

,city,job_title,company,salary,YearsOfExperience,btackets
0,Cairo,manager,Premium Card,38189.0,13.0,35-50
1,Cairo,Senior Software Engineer (.NET ),Egyptian Takaful Property and Liability,17648.0,3.0,15-20
2,Cairo,Software Support Engineer ( .NET),Hidden Name,17543.0,5.0,15-20
3,Cairo,Technical Office Engineer,Nahdet Misr Publishing Group,5334.0,2.0,5-10
4,Cairo,Website Content Manager,Dozzan,3649.0,0.0,2.5-5
...,...,...,...,...,...,...
10497,UAE,Senior iOS Developer,Gammal Tech,28090.0,4.0,20-35
10498,UAE,Senior Android Developer,Gammal Tech,23022.0,3.0,20-35
10499,UAE,Senior Sales Representative,Gammal Tech,9862.0,3.0,8-10
10500,USA,ERP Manager-Microsoft Dynamics 365 Function co...,Gammal Tech,27539.0,3.0,20-35
10501,USA,Software Project Coordinator,Gammal Tech,21881.0,5.0,20-35

In [3]:
df.drop(['btackets ','company'],axis=1,inplace=True)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10502 entries, 0 to 10501
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   city               10457 non-null  object
 1   job_title          10445 non-null  object
 2   salary             10458 non-null  float64
 3   YearsOfExperience  10458 non-null  float64
dtypes: float64(2), object(2)
memory usage: 328.3+ KB

In [5]:
df[df.isnull().any(axis=1)]

,city,job_title,salary,YearsOfExperience
152,NaN,NaN,NaN,NaN
162,NaN,NaN,NaN,NaN
165,NaN,NaN,NaN,NaN
166,NaN,NaN,NaN,NaN
169,NaN,NaN,NaN,NaN
170,NaN,NaN,NaN,NaN
231,NaN,NaN,NaN,NaN
276,NaN,NaN,NaN,NaN
313,NaN,NaN,NaN,NaN
328,NaN,NaN,NaN,NaN
486,NaN,NaN,NaN,NaN
501,NaN,NaN,NaN,NaN
503,NaN,NaN,NaN,NaN
729,NaN,NaN,NaN,NaN
846,NaN,NaN,NaN,NaN
847,NaN,NaN,NaN,NaN
859,NaN,NaN,NaN,NaN
918,NaN,NaN,NaN,NaN
919,NaN,NaN,NaN,NaN
1052,NaN,NaN,NaN,NaN
1064,NaN,NaN,NaN,NaN
1071,NaN,NaN,NaN,NaN
1078,NaN,NaN,NaN,NaN
1890,NaN,NaN,NaN,NaN
2240,NaN,NaN,NaN,NaN
3248,NaN,NaN,NaN,NaN
3391,NaN,NaN,NaN,NaN
4297,NaN,NaN,NaN,NaN
5334,NaN,NaN,NaN,NaN
5399,NaN,NaN,NaN,NaN
5516,NaN,NaN,NaN,NaN
5958,NaN,NaN,NaN,NaN
6437,NaN,NaN,NaN,NaN
6696,NaN,NaN,NaN,NaN
7059,NaN,NaN,NaN,NaN
7258,NaN,NaN,NaN,NaN
7729,NaN,NaN,NaN,NaN
8767,NaN,NaN,NaN,NaN
8826,NaN,NaN,NaN,NaN
9430,NaN,NaN,NaN,NaN
9669,NaN,NaN,NaN,NaN
9671,NaN,NaN,NaN,NaN
10082,NaN,NaN,NaN,NaN
10149,NaN,NaN,NaN,NaN
10268,Alexandria,NaN,11160.0,4.0
10287,Alexandria,NaN,23489.0,2.0
10305,Alexandria,NaN,16431.0,4.0
10306,Alexandria,NaN,8986.0,4.0
10310,Alexandria,NaN,13701.0,2.0
10316,Alexandria,NaN,29685.0,3.0
10318,Alexandria,NaN,9959.0,3.0
10354,Alexandria,NaN,12683.0,4.0
10358,Alexandria,NaN,8016.0,4.0
10368,Alexandria,NaN,21956.0,2.0
10421,UAE,NaN,27162.0,4.0
10422,NaN,Data Scientist - For USA (Remotely),14736.0,2.0
10457,UAE,NaN,18174.0,2.0
10465,UAE,NaN,19922.0,3.0

In [6]:
df.dropna(inplace=True)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10444 entries, 0 to 10501
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   city               10444 non-null  object
 1   job_title          10444 non-null  object
 2   salary             10444 non-null  float64
 3   YearsOfExperience  10444 non-null  float64
dtypes: float64(2), object(2)
memory usage: 408.0+ KB

In [8]:
df[df.duplicated()]

       city         job_title  salary  YearsOfExperience
4270  Cairo  Graphic Designer  4247.0                0.0

In [9]:
df.columns

Index(['city', 'job_title', 'salary', 'YearsOfExperience'], dtype='object')

In [10]:
df

,city,job_title,salary,YearsOfExperience
0,Cairo,manager,38189.0,13.0
1,Cairo,Senior Software Engineer (.NET ),17648.0,3.0
2,Cairo,Software Support Engineer ( .NET),17543.0,5.0
3,Cairo,Technical Office Engineer,5334.0,2.0
4,Cairo,Website Content Manager,3649.0,0.0
...,...,...,...,...
10497,UAE,Senior iOS Developer,28090.0,4.0
10498,UAE,Senior Android Developer,23022.0,3.0
10499,UAE,Senior Sales Representative,9862.0,3.0
10500,USA,ERP Manager-Microsoft Dynamics 365 Function co...,27539.0,3.0
10501,USA,Software Project Coordinator,21881.0,5.0

In [11]:
df.rename(columns = {'title':'job_title'}, inplace = True)

In [12]:
df.job_title=df.job_title.str.replace("\-"," ")
df.job_title=df.job_title.str.replace("\("," ")
df.job_title=df.job_title.str.replace("\)"," ")
df.job_title=df.job_title.str.replace("\/"," ")
df.job_title=df.job_title.str.replace("\\"," ")
df.job_title=df.job_title.str.replace("\|"," ")
df.job_title=df.job_title.str.replace("\_"," ")

##df.city=df.city.str.replace("Alexandria","Alexandria Governrate") *didn't solve the problem*
# Map problem (not solved, needs a research)

C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\2415811273.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df.job_title=df.job_title.str.replace("\-"," ")
C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\2415811273.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  df.job_title=df.job_title.str.replace("\("," ")
C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\2415811273.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  df.job_title=df.job_title.str.replace("\)"," ")
C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\2415811273.py:4: FutureWarning: The default value of regex will change from True to False in a future version.
  df.job_title=df.job_title.str.replace("\/"," ")
C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\2415811273.py:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df.job_title=df.job_title.str.replace("\\"," ")
C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\2415811273.py:6: FutureWarning: The default value of regex will change from True to False in a future version.
  df.job_title=df.job_title.str.replace("\|"," ")
C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\2415811273.py:7: FutureWarning: The default value of regex will change from True to False in a future version.
  df.job_title=df.job_title.str.replace("\_"," ")

In [13]:
df[df.job_title.str.contains('|'.join(['\-']))]

Empty DataFrame
Columns: [city, job_title, salary, YearsOfExperience]
Index: []

In [14]:
entry=df[df.YearsOfExperience<=3]
entry

,city,job_title,salary,YearsOfExperience
1,Cairo,Senior Software Engineer .NET,17648.0,3.0
3,Cairo,Technical Office Engineer,5334.0,2.0
4,Cairo,Website Content Manager,3649.0,0.0
5,Cairo,Technical Service Specialist,3707.0,1.0
6,Cairo,Call Center,4834.0,3.0
...,...,...,...,...
10492,UAE,Functional Consultant,8219.0,3.0
10494,UAE,Angular Developer Remote,8897.0,3.0
10498,UAE,Senior Android Developer,23022.0,3.0
10499,UAE,Senior Sales Representative,9862.0,3.0
10500,USA,ERP Manager Microsoft Dynamics 365 Function co...,27539.0,3.0

In [15]:
entry.job_title.nunique()

3035

In [16]:
entry.job_title=df.job_title.str.lower()
entry

C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\800596814.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  entry.job_title=df.job_title.str.lower()

,city,job_title,salary,YearsOfExperience
1,Cairo,senior software engineer .net,17648.0,3.0
3,Cairo,technical office engineer,5334.0,2.0
4,Cairo,website content manager,3649.0,0.0
5,Cairo,technical service specialist,3707.0,1.0
6,Cairo,call center,4834.0,3.0
...,...,...,...,...
10492,UAE,functional consultant,8219.0,3.0
10494,UAE,angular developer remote,8897.0,3.0
10498,UAE,senior android developer,23022.0,3.0
10499,UAE,senior sales representative,9862.0,3.0
10500,USA,erp manager microsoft dynamics 365 function co...,27539.0,3.0

In [17]:
entry.job_title.describe()

count                 4954
unique                2982
top       graphic designer
freq                   113
Name: job_title, dtype: object

In [18]:
Counter(entry.job_title).most_common(100)

[('graphic designer', 113),
 ('web designer', 56),
 ('php developer', 49),
 ('web developer', 49),
 ('software developer', 40),
 ('.net developer', 29),
 ('interior designer', 28),
 ('it specialist', 27),
 ('graphic designer ', 26),
 ('android developer', 25),
 ('project coordinator', 25),
 ('java developer', 23),
 ('senior php developer', 22),
 ('ios developer', 22),
 ('senior .net developer', 22),
 ('receptionist', 21),
 ('senior java developer', 21),
 ('electrical engineer', 20),
 ('mechanical engineer', 20),
 ('site engineer', 18),
 ('software engineer', 17),
 ('technical office engineer', 15),
 ('social media executive', 15),
 ('web designer ', 15),
 ('civil engineer', 15),
 ('junior .net developer', 15),
 ('technical support specialist', 14),
 ('maintenance engineer', 14),
 ('production engineer', 14),
 ('front end developer', 14),
 ('junior graphic designer', 12),
 ('ui ux designer', 12),
 ('software tester', 12),
 ('secretary', 11),
 ('junior php developer', 11),
 ('ui developer', 11),
 ('junior java developer', 11),
 ('senior software developer', 11),
 ('call center advisor   vf  uk  ', 11),
 ('senior ios developer', 11),
 ('senior android developer', 11),
 ('project engineer', 10),
 ('technical support engineer', 10),
 ('quality control specialist', 10),
 ('quality assurance specialist', 10),
 ('call center advisor   vf uk  ', 10),
 ('senior web developer', 10),
 ('tour operator', 9),
 ('customer service', 9),
 ('php web developer', 9),
 ('system engineer', 9),
 ('call center advisor', 8),
 ('electrical maintenance engineer', 8),
 ('planning engineer', 8),
 ('web developer ', 8),
 ('seo specialist', 8),
 ('mechanical engineer ', 8),
 ('international account advisor ', 8),
 ('customer service advisor  vis ', 8),
 ('junior software developer', 8),
 ('software quality control engineer', 8),
 ('senior graphic designer', 8),
 ('business analyst', 8),
 ('junior software engineer', 7),
 ('project manager', 7),
 ('german account advisor', 7),
 ('chemist', 7),
 ('technical writer', 7),
 ('technical support engineer ', 7),
 ('it technical support', 7),
 ('wordpress developer', 7),
 ('biomedical engineer', 7),
 ('junior architect', 7),
 ('system administrator', 7),
 ('copy editor', 7),
 ('enterprise technical support engineer', 7),
 ('quality control engineer', 6),
 ('executive secretary', 6),
 ('market researcher', 6),
 ('translator', 6),
 ('engineer', 6),
 ('mobile application developer', 6),
 ('receptionist ', 6),
 ('technical support', 6),
 ('business development specialist', 6),
 ('customer service advisor', 6),
 ('junior architect ', 6),
 ('electrical site engineer', 6),
 ('editorial assistant', 6),
 ('java developer ', 6),
 ('senior software developer ', 6),
 ('senior software engineer', 6),
 ('software quality engineer ', 6),
 ('senior sharepoint developer', 6),
 ('it help desk clerk ', 5),
 ('junior software developer ', 5),
 ('secretary ', 5),
 ('game master', 5),
 ('technical office engineer ', 5),
 ('mechanical design engineer', 5)]

In [19]:
df.job_title.nunique()

5669

In [20]:
df.job_title=df.job_title.str.lower()
df

,city,job_title,salary,YearsOfExperience
0,Cairo,manager,38189.0,13.0
1,Cairo,senior software engineer .net,17648.0,3.0
2,Cairo,software support engineer .net,17543.0,5.0
3,Cairo,technical office engineer,5334.0,2.0
4,Cairo,website content manager,3649.0,0.0
...,...,...,...,...
10497,UAE,senior ios developer,28090.0,4.0
10498,UAE,senior android developer,23022.0,3.0
10499,UAE,senior sales representative,9862.0,3.0
10500,USA,erp manager microsoft dynamics 365 function co...,27539.0,3.0
10501,USA,software project coordinator,21881.0,5.0

In [21]:
software_words = ['developer','devops','dev-ops','architect','html','css','app','sharepoint','crm','spring','angular',' vue ',' nest ',' node ','nodejs','node\.js','flask','golang','laravel','ruby on rails','cross platform','kotlin','xmarin','swift','react ','flutter','hybrid mobile','django','mongo','apache','nginx','cloud','docker','jira','implement','qa ','javascript','warehouse','intelligen','ai ','bi ','business intelligence','machine learning','computer vision','nlp','deep learning','compu','data engineer','programmer','programming','python','embedded','network','tech','wordpress','backend','frontend','front end','back end','web','linux','windows','mac ','macos','cyber','software','quality','php','it ','\.net','java','c\#','code','android','ios','aws','mobile','system','quality',' end','full stack','tester','fullstack','ui','ux','stack','database','data base','development','data analyst','analyst','data analysis','analytics','data','data science','data scientist','api ','kpi ','erp ','c\+\+','oracle','sql','db','dba']
software = df[df.job_title.str.contains('|'.join(software_words))]
software

,city,job_title,salary,YearsOfExperience
1,Cairo,senior software engineer .net,17648.0,3.0
2,Cairo,software support engineer .net,17543.0,5.0
3,Cairo,technical office engineer,5334.0,2.0
4,Cairo,website content manager,3649.0,0.0
5,Cairo,technical service specialist,3707.0,1.0
...,...,...,...,...
10496,UAE,c++ developer erp,29940.0,4.0
10497,UAE,senior ios developer,28090.0,4.0
10498,UAE,senior android developer,23022.0,3.0
10500,USA,erp manager microsoft dynamics 365 function co...,27539.0,3.0
10501,USA,software project coordinator,21881.0,5.0

In [22]:
df[~df.job_title.str.contains('|'.join(software_words))]

,city,job_title,salary,YearsOfExperience
0,Cairo,manager,38189.0,13.0
6,Cairo,call center,4834.0,3.0
7,Cairo,customer service call center specialist,3776.0,2.0
8,Giza,receptionist,4215.0,2.0
9,Alexandria,restaurant full staff,5555.0,4.0
...,...,...,...,...
10488,UAE,sales account manager,25241.0,2.0
10489,UAE,key account executive sales patisseries,12284.0,4.0
10492,UAE,functional consultant,8219.0,3.0
10495,UAE,medical sales representative,12071.0,4.0
10499,UAE,senior sales representative,9862.0,3.0

In [23]:
software.job_title.nunique()

2786

In [24]:
software[software.job_title.str.contains('big data')]

,city,job_title,salary,YearsOfExperience
180,Cairo,big data developer,8947.0,5.0
5814,Cairo,big data developer,9904.0,4.0
5815,Cairo,big data qa,12892.0,4.0
5819,Cairo,big data developer,16618.0,5.0
5820,Cairo,big data quality assurance specialist,9108.0,4.0
7758,Cairo,it analyst big data,12194.0,4.0
8261,Cairo,big data analyst,5764.0,4.0
8262,Cairo,big data analyst,6103.0,3.0
8713,Cairo,big data analyst,7927.0,4.0
9241,Cairo,"senior big data software engineer $7,500 month",15314.0,3.0

In [25]:
software[software.index==116]

      city          job_title   salary  YearsOfExperience
116  Cairo  technical analyst  15306.0                4.0

In [26]:
noise_list=['linux','mac ','obuntu','macos','mac os','windows','unix','pharma','solar','civil engineer','electrical engineer','electricity engineer','search','writ','technician','techinican','marketer','data entry','hr ','content']

noise0= software[software.job_title.str.contains('|'.join(noise_list))].index
software.drop(noise0, inplace=True)

noise1= software[(software.job_title.str.contains('system') & software.job_title.str.contains('admin'))].index
software.drop(noise1, inplace=True)

noise2= software[(((software.job_title.str.contains('system')) | (software.job_title.str.contains('software'))) & (software.job_title.str.contains('analyst')) & (~software.job_title.str.contains('business')) & (~software.job_title.str.contains('data')))].index
software.drop(noise2, inplace=True)

noise3= software[(software.job_title.str.contains('tech') & software.job_title.str.contains('analyst'))].index
software.drop(noise3, inplace=True)

noise0,noise1,noise2,noise3

C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\3698504247.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  software.drop(noise0, inplace=True)
C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\3698504247.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  software.drop(noise1, inplace=True)
C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\3698504247.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  software.drop(noise2, inplace=True)
C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\3698504247.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  software.drop(noise3, inplace=True)

(Int64Index([    4,    25,    89,    90,   207,   258,   261,   277,   335,
               344,
             ...
             10311, 10323, 10351, 10363, 10365, 10384, 10451, 10464, 10467,
             10493],
            dtype='int64', length=270),
 Int64Index([ 1254,  1382,  1433,  1434,  1757,  2172,  2330,  2640,  2756,
              2787,  2985,  3165,  3199,  3413,  3604,  3660,  3718,  3818,
              3842,  3884,  4088,  4356,  4900,  5459,  5536,  5707,  5788,
              5792,  5793,  5794,  5813,  6210,  6390,  6419,  6482,  6483,
              6493,  6614,  6618,  6643,  6697,  6886,  7081,  7275,  7412,
              7663,  8074,  8401,  8516,  8541,  8626,  8833,  9092,  9131,
              9167,  9184,  9491, 10276, 10292, 10317, 10339, 10375, 10423],
            dtype='int64'),
 Int64Index([ 1831,  3020,  3373,  3941,  4678,  6040,  6055,  6144,  6585,
              6662,  6876,  6942,  7001,  7101,  7260,  7495,  7547,  7836,
              8162,  8467,  8985,  9120,  9196,  9284,  9602, 10441],
            dtype='int64'),
 Int64Index([116, 3781, 10162, 10205], dtype='int64'))

In [27]:
software

,city,job_title,salary,YearsOfExperience
1,Cairo,senior software engineer .net,17648.0,3.0
2,Cairo,software support engineer .net,17543.0,5.0
3,Cairo,technical office engineer,5334.0,2.0
5,Cairo,technical service specialist,3707.0,1.0
11,Cairo,quality control engineer,4416.0,1.0
...,...,...,...,...
10496,UAE,c++ developer erp,29940.0,4.0
10497,UAE,senior ios developer,28090.0,4.0
10498,UAE,senior android developer,23022.0,3.0
10500,USA,erp manager microsoft dynamics 365 function co...,27539.0,3.0
10501,USA,software project coordinator,21881.0,5.0

In [28]:
software[software.job_title.str.contains('|'.join(['leader','senior','consultant']))]
# Team leader with 0 YearsOfExperience !!

,city,job_title,salary,YearsOfExperience
1,Cairo,senior software engineer .net,17648.0,3.0
120,Cairo,oracle applications consultant,4752.0,1.0
141,Cairo,senior php developer,13865.0,3.0
173,Cairo,senior software tester,15971.0,5.0
248,Giza,senior software application developer,19393.0,4.0
...,...,...,...,...
10480,UAE,senior business analyst,12416.0,4.0
10486,UAE,senior it specialist,8707.0,5.0
10497,UAE,senior ios developer,28090.0,4.0
10498,UAE,senior android developer,23022.0,3.0
10500,USA,erp manager microsoft dynamics 365 function co...,27539.0,3.0

In [29]:
software.job_title.nunique()

2557

In [30]:
Counter(software.job_title).most_common(50)

[('web developer', 106),
 ('web designer', 103),
 ('php developer', 95),
 ('senior .net developer', 70),
 ('senior php developer', 67),
 ('software developer', 67),
 ('ios developer', 61),
 ('.net developer', 56),
 ('java developer', 55),
 ('android developer', 53),
 ('it specialist', 45),
 ('senior java developer', 43),
 ('senior android developer', 41),
 ('senior ios developer', 39),
 ('senior web developer', 34),
 ('senior software developer', 32),
 ('technical office engineer', 30),
 ('software engineer', 29),
 ('front end developer', 29),
 ('ui developer', 28),
 ('web designer ', 26),
 ('software tester', 25),
 ('senior software engineer', 23),
 ('ui ux designer', 23),
 ('technical support engineer', 21),
 ('technical support specialist', 19),
 ('quality assurance specialist', 19),
 ('junior .net developer', 19),
 ('system engineer', 19),
 ('it manager', 19),
 ('business analyst', 18),
 ('mobile application developer', 18),
 ('web developer ', 17),
 ('senior web designer', 17),
 ('sw quality assurance engineer tester', 17),
 ('wordpress developer', 16),
 ('php web developer', 16),
 ('senior software tester', 16),
 ('oracle developer', 16),
 ('enterprise technical support engineer', 16),
 ('application support engineer', 15),
 ('senior front end developer', 15),
 ('senior sharepoint developer', 14),
 ('junior php developer', 13),
 ('php developer ', 13),
 ('quality control engineer', 12),
 ('senior software developer ', 12),
 ('ios developer ', 12),
 ('it technical support', 11),
 ('quality control specialist', 11)]

In [31]:
def job_replacer(x):
#     my_titles=['Back-End Developer','Full Stack Developer','Mobile Developer','UI/UX Designer','IT Specialist','Software Engineer','Database Administrator','Data Analyst','Front-End Developer','Tester','Network Engineer','Cyber Security','Machine Learning Engineer','Embedded Systems Engineer','Game Developer','Data Engineer','System Analyst!!!','Technical Analyst!!!','System Administrator!!!Database']
    my_titles=['Back-End Developer','Full Stack Developer','Mobile Developer','UI/UX Designer','IT Specialist','Software Engineer','Database Administrator','Data Analyst','Front-End Developer','Tester','Network Engineer','Cyber Security','Machine Learning Engineer','Embedded Systems Engineer','Game Developer','Data Engineer','Dev-Ops']
    
    if 'database' in x or 'data base' in x or 'warehouse' in x or 'oracle' in x or 'db ' in x or 'dba ' in x or 'sql' in x:
        return 'Database Administrator'
    elif '.net' in x or 'desktop' in x or 'j2ee' in x or 'jee' in x or 'rust' in x or 'crm' in x or 'java' in x or 'dot net' in x or 'php' in x or 'c#' in x or 'backend' in x or 'back end' in x or 'spring' in x or ' nest ' in x or ' node ' in x or 'nodejs' in x or 'node.js' in x or 'flask' in x or 'golang' in x or 'laravel' in x or 'ruby on rails' in x or 'django' in x or 'mongo' in x or 'apache' in x or 'nginx' in x or 'jira' in x:
        return 'Back-End Developer'
    elif 'front' in x or 'angular' in x or ' vue ' in x or 'react' in x or 'html' in x or 'css' in x:
        return 'Front-End Developer'
    elif 'fullstack' in x or'full stack' in x or ('web' in x and ('develop' in x or 'app' in x or 'support' in x or 'engineer' or 'implement' in x or 'consult' in x or 'program' in x or 'code' in x or 'specialist' in x or 'process' in x or 'operat' in x or 'manag' in x or 'advisor' in x or 'assist' in x)) or 'wordpress' in x or 'javascript' in x or 'solution' in x or 'sharepoint' in x:
        return 'Full Stack Developer'
    elif 'data science' in x or 'data scientist' in x:
        return 'Data Scientist'
    elif 'cloud' in x or 'docker' in x or 'aws' in x or 'api ' in x or 'ops ' in x or 'devops' in x or 'dev-ops' in x:
        return 'Dev-Ops'
    elif 'cyber' in x or 'security' in x:
        return 'Cyber Security'
    elif ('data' in x and 'engineer' in x) or ('big' in x and 'data' in x and 'anal' not in x):
        return 'Data Engineer'
    elif 'embedded' in x:
        return 'Embedded Systems Engineer'
    elif 'network' in x:
        return 'Network Engineer'
    elif 'design' in x or 'ui' in x or 'ux' in x or 'interface' in x:
        return 'UI/UX Designer'
    elif 'test' in x or 'quality' in x or 'qa ' in x or 'qc ' in x:
        return 'Tester'
    elif 'data analyst' in x or 'analyst' in x or ('business' in x and ('analyst' in x or 'intelligen' in x)) or 'data analysis' in x or 'analytics' in x or 'bi ' in x or ('data' in x and ('develop' in x or 'support' in x or 'implement' in x or 'program' in x or 'code' in x or 'specialist' in x or 'process' in x or 'operat' in x or 'manag' in x or 'advisor' in x or 'assist' in x or 'consult' in x or 'big' in x)):
        return 'Data Analyst'
    elif 'machine learning' in x or 'ai ' in x or 'intelligen' in x or 'deep learning' in x or 'computer vision' in x or 'nlp' in x:
        return 'Machine Learning Engineer'
    elif 'it ' in x:
        for title in x :
            if title.find('it ')-1 < 0:
                return ('IT Specialist')
            elif title[(title.find('it ')-1)] == ' ':
                return('IT Specialist')
            else :
                software.drop(software[(software.job_title.str.contains(title))].index , inplace=True)
    elif 'game' in x:
        return 'Game Developer'
    elif 'tech' in x:
        return 'IT Specialist'
    
    elif ('app' in x and 'web' not in x and ('develop' in x or 'support' in x or 'engineer' or 'consult' in x or 'implement' in x or 'program' in x or 'code' in x or 'specialist' in x or 'process' in x or 'operat' in x or 'manag' in x or 'advisor' in x or 'assist' in x)) or 'android' in x or 'gsm' in x or 'ios' in x or 'mobile' in x or 'cross platform' in x or 'kotlin' in x or 'xmarin' in x or 'swift' in x or 'react native' in x or 'flutter' in x or 'hybrid mobile' in x or 'phone' in x:
        return 'Mobile Developer'
    elif 'software' in x or 'computer' in x or 'architect' in x or 'erp ' in x or 'system' in x or 'develop' in x or 'implement' in x or 'program' in x or 'code' in x:
        return 'Software Engineer'
  
    else:
        return x

software.job_title=software.job_title.apply(job_replacer)

my_titles=['Back-End Developer','Full Stack Developer','Mobile Developer','UI/UX Designer','IT Specialist','Software Engineer','Database Administrator','Data Analyst','Front-End Developer','Tester','Network Engineer','Cyber Security','Machine Learning Engineer','Embedded Systems Engineer','Game Developer','Data Engineer','Dev-Ops']
for title in software.job_title:
    if title not in my_titles:
        software.drop(software[(software.job_title==title)].index , inplace=True)
        
        
# Putting salaries into ranges helps to vizualize more clear charts
# def salary_ranges(s):
#     if s <=2500:
#         return "<=2.5K"
#     elif s>2500 and s <=5000:
#         return "2.5-5K"
#     elif s>5000 and s <=10000:
#         return "5-10K"
#     elif s>10000 and s <=15000:
#         return "10-15K"
#     elif s>15000 and s <=20000:
#         return "15-20K"
#     elif s>20000 and s <=30000:
#         return "20-30K"
#     elif s>30000 and s <=50000:
#         return "30-50K"
#     elif s >50000:
#         return "+50K"
#     else: return s
# software['salary_in_range']=software.salary.apply(salary_ranges)

C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\771136612.py:54: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  software.job_title=software.job_title.apply(job_replacer)
C:\Users\DELL\AppData\Local\Temp\ipykernel_5384\771136612.py:59: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  software.drop(software[(software.job_title==title)].index , inplace=True)

In [32]:
software

        city           job_title   salary  YearsOfExperience
1      Cairo  Back-End Developer  17648.0                3.0
2      Cairo  Back-End Developer  17543.0                5.0
3      Cairo       IT Specialist   5334.0                2.0
5      Cairo       IT Specialist   3707.0                1.0
11     Cairo              Tester   4416.0                1.0
...      ...                 ...      ...                ...
10496    UAE   Software Engineer  29940.0                4.0
10497    UAE    Mobile Developer  28090.0                4.0
10498    UAE    Mobile Developer  23022.0                3.0
10500    USA   Software Engineer  27539.0                3.0
10501    USA   Software Engineer  21881.0                5.0

[5265 rows x 4 columns]

In [33]:
Counter(software.job_title).most_common(50)

[('Back-End Developer', 1164),
 ('Software Engineer', 776),
 ('Full Stack Developer', 716),
 ('IT Specialist', 700),
 ('Mobile Developer', 529),
 ('Tester', 509),
 ('UI/UX Designer', 253),
 ('Database Administrator', 198),
 ('Data Analyst', 122),
 ('Front-End Developer', 122),
 ('Network Engineer', 65),
 ('Cyber Security', 41),
 ('Dev-Ops', 18),
 ('Data Engineer', 15),
 ('Embedded Systems Engineer', 15),
 ('Machine Learning Engineer', 12),
 ('Game Developer', 10)]

In [34]:
software[software.job_title== 'Machine Learning Engineer'].link

AttributeError: 'DataFrame' object has no attribute 'link'

In [ ]:
len(my_titles)

In [ ]:
software.describe()

In [35]:
software.to_excel(r"C:\Users\DELL\Downloads\software_ranges.xlsx")

In [ ]:
px.histogram(software,y=software.job_title,color=software.job_title,color_discrete_map={
            81: "rgb(31,120,180)"
        }).update_yaxes(categoryorder='total ascending')
# plt.xticks(rotation=90) ,x=software.job_title.value_counts()
# plt.show()  ,order = software.job_title.value_counts().index

In [ ]:
my_titles=['Back-End Developer','Full Stack Developer','Mobile Developer','UI/UX Designer','IT Specialist','Software Engineer','Database Administrator','Data Analyst','Front-End Developer','Tester','Network Engineer','Cyber Security','Machine Learning Engineer','Embedded Systems Engineer','Game Developer','Data Engineer','System Analyst','Technical Analyst','System Administrator']
for title in software.job_title:
    if title not in my_titles:
        print(title)
        software.drop(software[(software.job_title==title)].index , inplace=True)

In [ ]:
titles = ['app','application manager','web application developer','senior']
'm' in titles
# for x in titles :
#     if ('app' in x and 'web' not in x and ('develop' in x or 'support' in x or 'engineer' or 'consult' in x or 'implement' in x or 'program' in x or 'code' in x or 'specialist' in x or 'process' in x or 'operat' in x or 'manag' in x or 'advisor' in x or 'assist' in x)) or 'android' in x or 'gsm' in x or 'ios' in x or 'mobile' in x or 'cross platform' in x or 'kotlin' in x or 'xmarin' in x or 'swift' in x or 'react native' in x or 'flutter' in x or 'hybrid mobile' in x or 'phone' in x:
#         print('mobile')
#     else :
#         print('not mobile')

In [ ]:
software[software.job_title.str.contains('|'.join(['sql']))]

In [ ]:
entry[entry.company.str.contains('|'.join(['DEVOPSolution']))]

In [ ]:
software

In [ ]:
software[software.job_title.str.contains('|'.join(['developer']))]

In [ ]:
titles = ['credit card','it specialist','unit manager','senior it helper']
for title in titles :
    if title.find('it ')-1 < 0:
        print('it specialist')
    elif title[(title.find('it ')-1)] == ' ':
        print('it specialist')
    else :
        print('not it')

In [ ]:
software.job_title=software.job_title.apply(lambda x: '.Net Developer' if '.net' in x else x)
software[software.job_title]

In [ ]:
net[net.job_title.str.contains('|'.join(['net']))]

In [ ]:
# See wanted words in job_titles in software to remove the most frequent other job_titles in other fields

wanted = df[df.job_title.str.contains(['developer','engineer','web','senior','junior','technical','-','software','specialist','&','quality','php','it','support','project','.net','java','/','site','control','maintenence','administrator','android','ios','aws','mobile','system','(',')',',','front-end','tester','engineering','ui','ux','ui/ux','intern','internship','database','end','development','analyst','data','and','systems','alexandria','erp','c++'])]

# if  any(word in jobs for word in wanted):
#     print((Counter(" ".join(df.job_title.str.contains(wanted)).split())).most_common(100))
    
# res = [i for i in df.job_title if wanted in i]
# res
wanted

In [ ]:
df.job_title.str.

In [ ]:
px.histogram(df,x=df.job_title.sort_values(ascending=False))

In [ ]:
unwanted=df[df.job_title.str.contains('graphic','doctor',)]

In [ ]:
def is_software (x) :
    if any(software_words) in x :
        x['software'] = 1
    else:
        x['software'] = 0
entry.job_title=entry.job_title.apply(is_software)
entry

In [ ]:
fig = px.pie(entry, values='software', names='software')
fig.show()

In [ ]:
plt.pie(entry['software']);

In [ ]:
if software[software.job_title.str.contains('|'.join(['\.net']))]==True :
    software.job_title = "\.net developer"
software

In [ ]:
# Finding 'brackets' exact meaning
px.scatter(df,y=df.salary,x=df.brackets)

In [ ]:
df.YearsOfExperience.describe()

In [ ]:
len(heatmap_cols)

In [ ]:
m={'job_title':['system analyst','system','admin','data analyst','data','business','business analyst','software business analyst']}
software=pd.DataFrame(data=m)
(((software.job_title.str.contains('system')) | (software.job_title.str.contains('software'))) & (software.job_title.str.contains('analyst')) & (~software.job_title.str.contains('business')) & (~software.job_title.str.contains('data')))